{
    "400": {
        "name": "Bad Request",
        "message": "The request cannot be fulfilled due to bad syntax."
    },
    "401": {
        "name": "Unauthorized",
        "message": "Authentication is required and has failed or has not yet been provided."
    },
    "402": {
        "name": "Payment Required",
        "message": "Payment is required and has failed or has not yet been provided."
    },
    "403": {
        "name": "Forbidden",
        "message": "The request was a valid request, but the server is refusing to respond to it."
    },
    "404": {
        "name": "Not Found",
        "message": "The requested resource could not be found but may be available again in the future."
    },
    "405": {
        "name": "Method Not Allowed",
        "message": "A request was made of a resource using a request method not supported by that resource."
    },
    "406": {
        "name": "Not Acceptable",
        "message": "The requested resource is only capable of generating content not acceptable."
    },
    "407": {
        "name": "Proxy Authentication Required",
        "message": "Proxy authentication is required and has failed or has not yet been provided."
    },
    "408": {
        "name": "Request Timeout",
        "message": "The server did not receive a complete request message in time."
    },
    "409": {
        "name": "Conflict",
        "message": "The request could not be processed because of conflict in the request."
    },
    "410": {
        "name": "Gone",
        "message": "The requested resource is no longer available and will not be available again."
    },
    "411": {
        "name": "Length Required",
        "message": "The request did not specify the length of its content, which is required by the resource."
    },
    "412": {
        "name": "Precondition Failed",
        "message": "The server does not meet one of the preconditions that the requester put on the request."
    },
    "413": {
        "name": "Payload Too Large",
        "message": "The server cannot process the request because the request payload is too large."
    },
    "414": {
        "name": "URI Too Long",
        "message": "The request-target is longer than the server is willing to interpret."
    },
    "415": {
        "name": "Unsupported Media Type",
        "message": "The request entity has a media type which the server or resource does not support."
    },
    "416": {
        "name": "Requested Range Not Satisfiable",
        "message": "The range specified by the Range header field in the request cannot be fulfilled."
    },
    "417": {
        "name": "Expectation Failed",
        "message": "The expectation given could not be met by at least one of the inbound servers."
    },
    "418": {
        "name": "I'm a teapot",
        "message": "The server refuses the attempt to brew coffee with a teapot."
    },
    "421": {
        "name": "Misdirected Request",
        "message": "The request was directed at a server that is not able to produce a response."
    },
    "422": {
        "name": "Unprocessable Entity",
        "message": "The request was well-formed but was unable to be followed due to semantic errors."
    },
    "423": {
        "name": "Locked",
        "message": "The resource that is being accessed is locked."
    },
    "424": {
        "name": "Failed Dependency",
        "message": "The request failed due to failure of a previous request."
    },
    "425": {
        "name": "Too Early",
        "message": "The server is unwilling to risk processing a request that might be replayed."
    },
    "426": {
        "name": "Upgrade Required",
        "message": "The server cannot process the request using the current protocol."
    },
    "428": {
        "name": "Precondition Required",
        "message": "The origin server requires the request to be conditional."
    },
    "429": {
        "name": "Too Many Requests",
        "message": "The user has sent too many requests in a given amount of time."
    },
    "431": {
        "name": "Request Header Fields Too Large",
        "message": "The server is unwilling to process the request because its header fields are too large."
    },
    "451": {
        "name": "Unavailable For Legal Reasons",
        "message": "The server is unwilling to process the request due to legal reasons."
    },
    "500": {
        "name": "Internal Server Error",
        "message": "An error has occurred and this resource cannot be displayed."
    },
    "501": {
        "name": "Not Implemented",
        "message": "The server either does not recognize the request method, or it lacks the ability to fulfil the request."
    },
    "502": {
        "name": "Bad Gateway",
        "message": "The server was acting as a gateway or proxy and received an invalid response from the upstream server."
    },
    "503": {
        "name": "Service Unavailable",
        "message": "The server is currently unavailable. It may be overloaded or down for maintenance."
    },
    "504": {
        "name": "Gateway Timeout",
        "message": "The server was acting as a gateway or proxy and did not receive a timely response from the upstream server."
    },
    "505": {
        "name": "HTTP Version Not Supported",
        "message": "The server does not support the HTTP protocol version used in the request."
    },
    "506": {
        "name": "Variant Also Negotiates",
        "message": "The server has an internal configuration error relating to content negotiation."
    },
    "507": {
        "name": "Insufficient Storage",
        "message": "The server has an internal configuration error relating to free memory."
    },
    "508": {
        "name": "Loop Detected",
        "message": "The server detected an infinite loop while processing the request."
    },
    "510": {
        "name": "Not Extended",
        "message": "Further extensions to the request are required for the server to fulfill it."
    },
    "511": {
        "name": "Network Authentication Required",
        "message": "The client needs to authenticate to gain network access."
    }
}
